# encoding: utf-8
module Babosa
  module Transliterator
    class Slovak < Latin
      APPROXIMATIONS = {
        "á" => "a",
        "ä" => "a",
        "č" => "c",
        "ď" => "d",
        "é" => "e",
        "í" => "i",
        "ľ" => "l",
        "ĺ" => "l",
        "ň" => "n",
        "ó" => "o",
        "ô" => "o",
        "ŕ" => "r",
        "š" => "s",
        "ť" => "t",
        "ú" => "u",
        "ý" => "y",
        "ž" => "z",
        "Á" => "a",
        "Ä" => "A",
        "Č" => "C",
        "Ď" => "D",
        "É" => "E",
        "Í" => "I",
        "Ľ" => "L",
        "Ĺ" => "L",
        "Ň" => "N",
        "Ó" => "O",
        "Ô" => "O",
        "Ŕ" => "R",
        "Š" => "S",
        "Ť" => "T",
        "Ú" => "U",
        "Ý" => "Y",
        "Ž" => "Z"
      }
    end
  end
end
